insert into user (id, password, nickname, user_type)
values 
('dlawhdfbf12', 1234, '메카종율', 2), #1
('tortor1403', 1234, '고늑최', 2), #2
('pnlkc', 1234, '최지찬', 1), #3
('animus', 1234, '유동건', 1), #4
('kth32105', 1234, '김태훈', 1), #5
('smink95', 1234, '고승민', 1), #6
('hwasuk528', 1234, '오화석', 1), #7
('choyool123', 1234, '조성호', 1), #8
('godsun7892', 1234, '유광우', 1), #9
('weakprotos', 1234, '이승재', 3), #10
('dlawhdfbf12@naver.com', 1234, '메카종율', 1),
('tortor1403@gmail.com', 1234, '고독한늑대최민호', 1);
;

insert into user_article (writer_seq, title, content)
values 
(1, "회원 모집합니다.", "트레이너 메카종율 자세한 내용은 전화로 010xxxxxxx"), #1
(2, "윗집보다 맛있는 집", "트레이너 고늑최 회원 모집합니다. 자세한 내용은 전화로 010xxxxxxx"), #2
(4, "같이 운동하실분", "역삼역 저녁 6시에 XXGYM에서 하실분 두 명 구해요@@@@@!!"), #3
(1, "임종율의 오리아나", "공기 팡~"),
(1, "유광우 닐라", "유광우 찰~싹"),
(1, "고늑최", "레넥밴"),
(2, "테스트게시물 1", "테스트게시물내용"),
(2, "테스트게시물 2", "테스트게시물내용"),
(2, "테스트게시물 3", "테스트게시물내용"),
(2, "테스트게시물 4", "테스트게시물내용"),
(2, "테스트게시물 5", "테스트게시물내용"),
(2, "테스트게시물 6", "테스트게시물내용"),
(2, "테스트게시물 7", "테스트게시물내용"),
(2, "테스트게시물 8", "테스트게시물내용"),
(2, "테스트게시물 9", "테스트게시물내용"),
(2, "테스트게시물 10", "테스트게시물내용"),
(2, "테스트게시물 11", "테스트게시물내용"),
(2, "테스트게시물 12", "테스트게시물내용"),
(2, "테스트게시물 13", "테스트게시물내용"),
(2, "테스트게시물 14", "테스트게시물내용"),
(2, "테스트게시물 15", "테스트게시물내용"),
(2, "테스트게시물 16", "테스트게시물내용"),
(2, "테스트게시물 17", "테스트게시물내용"),
(2, "테스트게시물 18", "테스트게시물내용"),
(2, "테스트게시물 19", "테스트게시물내용"),
(2, "테스트게시물 20", "테스트게시물내용"),
(2, "테스트게시물 21", "테스트게시물내용"),
(2, "테스트게시물 22", "테스트게시물내용"),
(2, "테스트게시물 23", "테스트게시물내용"),
(2, "테스트게시물 24", "테스트게시물내용"),
(2, "테스트게시물 25", "테스트게시물내용"),
(2, "테스트게시물 26", "테스트게시물내용"),
(2, "테스트게시물 27", "테스트게시물내용"),
(2, "테스트게시물 28", "테스트게시물내용"),
(2, "테스트게시물 29", "테스트게시물내용"),
(2, "테스트게시물 30", "테스트게시물내용"),
(2, "테스트게시물 31", "테스트게시물내용"),
(2, "테스트게시물 32", "테스트게시물내용"),
(2, "테스트게시물 33", "테스트게시물내용"),
(2, "테스트게시물 34", "테스트게시물내용"),
(2, "테스트게시물 35", "테스트게시물내용"),
(2, "테스트게시물 36", "테스트게시물내용"),
(2, "테스트게시물 37", "테스트게시물내용"),
(2, "테스트게시물 38", "테스트게시물내용"),
(2, "테스트게시물 39", "테스트게시물내용"),
(2, "테스트게시물 40", "테스트게시물내용"),
(2, "테스트게시물 41", "테스트게시물내용"),
(2, "테스트게시물 42", "테스트게시물내용"),
(2, "테스트게시물 43", "테스트게시물내용"),
(2, "테스트게시물 44", "테스트게시물내용"),
(2, "테스트게시물 45", "테스트게시물내용"),
(2, "테스트게시물 46", "테스트게시물내용"),
(2, "테스트게시물 47", "테스트게시물내용"),
(2, "테스트게시물 48", "테스트게시물내용"),
(2, "테스트게시물 49", "테스트게시물내용"),
(2, "테스트게시물 50", "테스트게시물내용"),
(2, "테스트게시물 51", "테스트게시물내용"),
(2, "테스트게시물 52", "테스트게시물내용"),
(2, "테스트게시물 53", "테스트게시물내용"),
(2, "테스트게시물 54", "테스트게시물내용"),
(2, "테스트게시물 55", "테스트게시물내용"),
(2, "테스트게시물 56", "테스트게시물내용"),
(2, "테스트게시물 57", "테스트게시물내용"),
(2, "테스트게시물 58", "테스트게시물내용"),
(2, "테스트게시물 59", "테스트게시물내용"),
(2, "테스트게시물 60", "테스트게시물내용"),
(2, "테스트게시물 61", "테스트게시물내용"),
(2, "테스트게시물 62", "테스트게시물내용"),
(2, "테스트게시물 63", "테스트게시물내용"),
(2, "테스트게시물 64", "테스트게시물내용"),
(2, "테스트게시물 65", "테스트게시물내용"),
(2, "테스트게시물 66", "테스트게시물내용"),
(2, "테스트게시물 67", "테스트게시물내용"),
(2, "테스트게시물 68", "테스트게시물내용"),
(2, "테스트게시물 69", "테스트게시물내용"),
(2, "테스트게시물 70", "테스트게시물내용"),
(2, "테스트게시물 71", "테스트게시물내용"),
(2, "테스트게시물 72", "테스트게시물내용"),
(2, "테스트게시물 73", "테스트게시물내용"),
(2, "테스트게시물 74", "테스트게시물내용"),
(2, "테스트게시물 75", "테스트게시물내용"),
(2, "테스트게시물 76", "테스트게시물내용"),
(2, "테스트게시물 77", "테스트게시물내용"),
(2, "테스트게시물 78", "테스트게시물내용"),
(2, "테스트게시물 79", "테스트게시물내용"),
(2, "테스트게시물 80", "테스트게시물내용"),
(2, "테스트게시물 81", "테스트게시물내용"),
(2, "테스트게시물 82", "테스트게시물내용"),
(2, "테스트게시물 83", "테스트게시물내용"),
(2, "테스트게시물 84", "테스트게시물내용"),
(2, "테스트게시물 85", "테스트게시물내용"),
(2, "테스트게시물 86", "테스트게시물내용"),
(2, "테스트게시물 87", "테스트게시물내용"),
(2, "테스트게시물 88", "테스트게시물내용"),
(2, "테스트게시물 89", "테스트게시물내용"),
(2, "테스트게시물 90", "테스트게시물내용"),
(2, "테스트게시물 91", "테스트게시물내용"),
(2, "테스트게시물 92", "테스트게시물내용"),
(2, "테스트게시물 93", "테스트게시물내용"),
(2, "테스트게시물 94", "테스트게시물내용"),
(2, "테스트게시물 95", "테스트게시물내용"),
(2, "테스트게시물 96", "테스트게시물내용"),
(2, "테스트게시물 97", "테스트게시물내용"),
(2, "테스트게시물 98", "테스트게시물내용"),
(2, "테스트게시물 99", "테스트게시물내용"),
(2, "테스트게시물 100", "테스트게시물내용"),
(2, "테스트게시물 101", "테스트게시물내용"),
(2, "테스트게시물 102", "테스트게시물내용"),
(2, "테스트게시물 103", "테스트게시물내용"),
(2, "테스트게시물 104", "테스트게시물내용"),
(2, "테스트게시물 105", "테스트게시물내용"),
(2, "테스트게시물 106", "테스트게시물내용"),
(2, "테스트게시물 107", "테스트게시물내용"),
(2, "테스트게시물 108", "테스트게시물내용"),
(2, "테스트게시물 109", "테스트게시물내용"),
(2, "테스트게시물 110", "테스트게시물내용"),
(2, "테스트게시물 111", "테스트게시물내용"),
(2, "테스트게시물 112", "테스트게시물내용"),
(2, "테스트게시물 113", "테스트게시물내용"),
(2, "테스트게시물 114", "테스트게시물내용"),
(2, "테스트게시물 115", "테스트게시물내용"),
(2, "테스트게시물 116", "테스트게시물내용"),
(2, "테스트게시물 117", "테스트게시물내용"),
(2, "테스트게시물 118", "테스트게시물내용"),
(2, "테스트게시물 119", "테스트게시물내용"),
(2, "테스트게시물 120", "테스트게시물내용"),
(2, "테스트게시물 121", "테스트게시물내용"),
(2, "테스트게시물 122", "테스트게시물내용"),
(2, "테스트게시물 123", "테스트게시물내용"),
(2, "테스트게시물 124", "테스트게시물내용"),
(2, "테스트게시물 125", "테스트게시물내용"),
(2, "테스트게시물 126", "테스트게시물내용"),
(2, "테스트게시물 127", "테스트게시물내용"),
(2, "테스트게시물 128", "테스트게시물내용"),
(2, "테스트게시물 129", "테스트게시물내용"),
(2, "테스트게시물 130", "테스트게시물내용"),
(2, "테스트게시물 131", "테스트게시물내용"),
(2, "테스트게시물 132", "테스트게시물내용"),
(2, "테스트게시물 133", "테스트게시물내용"),
(2, "테스트게시물 134", "테스트게시물내용"),
(2, "테스트게시물 135", "테스트게시물내용"),
(2, "테스트게시물 136", "테스트게시물내용"),
(2, "테스트게시물 137", "테스트게시물내용"),
(2, "테스트게시물 138", "테스트게시물내용"),
(2, "테스트게시물 139", "테스트게시물내용"),
(2, "테스트게시물 140", "테스트게시물내용"),
(2, "테스트게시물 141", "테스트게시물내용"),
(2, "테스트게시물 142", "테스트게시물내용"),
(2, "테스트게시물 143", "테스트게시물내용"),
(2, "테스트게시물 144", "테스트게시물내용"),
(2, "테스트게시물 145", "테스트게시물내용"),
(2, "테스트게시물 146", "테스트게시물내용"),
(2, "테스트게시물 147", "테스트게시물내용"),
(2, "테스트게시물 148", "테스트게시물내용"),
(2, "테스트게시물 149", "테스트게시물내용"),
(2, "테스트게시물 150", "테스트게시물내용"),
(2, "테스트게시물 151", "테스트게시물내용"),
(2, "테스트게시물 152", "테스트게시물내용"),
(2, "테스트게시물 153", "테스트게시물내용"),
(2, "테스트게시물 154", "테스트게시물내용"),
(2, "테스트게시물 155", "테스트게시물내용"),
(2, "테스트게시물 156", "테스트게시물내용"),
(2, "테스트게시물 157", "테스트게시물내용"),
(2, "테스트게시물 158", "테스트게시물내용"),
(2, "테스트게시물 159", "테스트게시물내용"),
(2, "테스트게시물 160", "테스트게시물내용"),
(2, "테스트게시물 161", "테스트게시물내용"),
(2, "테스트게시물 162", "테스트게시물내용"),
(2, "테스트게시물 163", "테스트게시물내용"),
(2, "테스트게시물 164", "테스트게시물내용"),
(2, "테스트게시물 165", "테스트게시물내용"),
(2, "테스트게시물 166", "테스트게시물내용"),
(2, "테스트게시물 167", "테스트게시물내용"),
(2, "테스트게시물 168", "테스트게시물내용"),
(2, "테스트게시물 169", "테스트게시물내용"),
(2, "테스트게시물 170", "테스트게시물내용"),
(2, "테스트게시물 171", "테스트게시물내용"),
(2, "테스트게시물 172", "테스트게시물내용"),
(2, "테스트게시물 173", "테스트게시물내용"),
(2, "테스트게시물 174", "테스트게시물내용"),
(2, "테스트게시물 175", "테스트게시물내용"),
(2, "테스트게시물 176", "테스트게시물내용"),
(2, "테스트게시물 177", "테스트게시물내용"),
(2, "테스트게시물 178", "테스트게시물내용"),
(2, "테스트게시물 179", "테스트게시물내용"),
(2, "테스트게시물 180", "테스트게시물내용"),
(2, "테스트게시물 181", "테스트게시물내용"),
(2, "테스트게시물 182", "테스트게시물내용"),
(2, "테스트게시물 183", "테스트게시물내용"),
(2, "테스트게시물 184", "테스트게시물내용"),
(2, "테스트게시물 185", "테스트게시물내용"),
(2, "테스트게시물 186", "테스트게시물내용"),
(2, "테스트게시물 187", "테스트게시물내용"),
(2, "테스트게시물 188", "테스트게시물내용"),
(2, "테스트게시물 189", "테스트게시물내용"),
(2, "테스트게시물 190", "테스트게시물내용"),
(2, "테스트게시물 191", "테스트게시물내용"),
(2, "테스트게시물 192", "테스트게시물내용"),
(2, "테스트게시물 193", "테스트게시물내용"),
(2, "테스트게시물 194", "테스트게시물내용"),
(2, "테스트게시물 195", "테스트게시물내용"),
(2, "테스트게시물 196", "테스트게시물내용"),
(2, "테스트게시물 197", "테스트게시물내용"),
(2, "테스트게시물 198", "테스트게시물내용"),
(2, "테스트게시물 199", "테스트게시물내용");

insert into user_article_comment (article_id, writer_seq, content)
values 
(1, 3, "저요저용~!"),
(1, 5, "나도..!"),
(1, 6, "마렵넹..."),
(2, 9, "과아아아앙우 합류한다아아아아"),
(2, 8, "전화를 안받는뎁쇼??"),
(3, 7, "저요저요"),
(3, 6, "같이하자 동건~"),
(1, 1, "개추~!"),
(2, 1, "과아아아앙우"),
(3, 1, "ㄹㅇㅋㅋㅋ");

INSERT INTO video (writer_seq, title, content, part, url, video_key)
VALUES
('12', '김성환 가슴운동', '테스트입니다', 'chest', 'https://www.youtube.com/watch?v=90ZmjAb7dvE&t=4s&ab_channel=%EA%B9%80%EC%84%B1%ED%99%98%ED%97%AC%EC%8A%A4%EC%9C%A0%ED%8A%9C%EB%B8%8C', '90ZmjAb7dvE'),
('2', '김성환 등운동', '테스트', 'back', 'https://www.youtube.com/watch?v=grhZV-mWxKY&ab_channel=%EA%B9%80%EC%84%B1%ED%99%98%ED%97%AC%EC%8A%A4%EC%9C%A0%ED%8A%9C%EB%B8%8C', 'grhZV-mWxKY');


INSERT INTO video_review (video_id, writer_seq, title, content)
VALUES
('1', '2', '저도 임종율처럼 가슴이 커지고싶어요', '그의 벤치에는 감동이 있다'),
('1', '2', '가슴킹 임종율', '그의 벤치에는 감동이 있다');

# 트레이너와 함께 운동한 사람이 아니라면 trainner_seq는 0
# 시간도 다르게 넣을지는 생각 필요(작성당시 무지성)
# 사람을 왜 많이 하고 있는지 까먹음 ㅋㅋㅋ
# 그냥 대규모로 할지 -> 사람을 적게 횟수를 많게 고민중

# 수정필요 -> trainer_seq가 user_seq(1~3)를 fk로 가지고 있는데 0을 넣으면 에러남
INSERT INTO record (user_seq, trainner_seq, body_weight, body_fat_mass, skeletal_muscle_mass)
VALUES
(3, 1, 55, 6.3, 22.8), #1 종율 -> 지찬
(5, 1, 60, 6.1, 26.8), #2 종율 -> 태훈
(6, 1, 70, 9.4, 33.7), #3 종율 -> 승민이형
(9, 2, 68, 10.3, 31.2), #4 민호 -> 광우형
(8, 2, 72, 11.3, 35.8), #5 민호 -> 성호
(7, 0, 40, 8, 35.8), #6 화석 with 똥건이형
(6, 0, 69, 9.1, 33.8) #7 승민이형 with 똥건이형
;

commit;
